[
	{
		"id" : "71jlbIpR58",
		"type" : "faq",
		"title" : "Are credit card payments required to be reported?",
		"slug" : "are-credit-card-payments-required-to-be-reported",
		"content" : "Yes, if they meet the criteria of a trade credit arrangement, exceed $100 (incl. GST), and are not excluded under a genuinely enforced policy or other exceptions.",
		"description" : null,
		"date" : null,
		"tags" : null,
		"createdBy" : "import-script",
		"updatedBy" : null,
		"createdAt" : "2025-05-22 06:41:42",
		"updatedAt" : "2025-05-22 06:41:42"
	},
	{
		"id" : "86mIaODke8",
		"type" : "faq",
		"title" : "Can more time be requested to submit a report?",
		"slug" : "can-more-time-be-requested-to-submit-a-report",
		"content" : "Yes, via the Portal. Extensions of up to 28 days require a reason, while longer extensions need supporting documentation.",
		"description" : null,
		"date" : null,
		"tags" : null,
		"createdBy" : "import-script",
		"updatedBy" : null,
		"createdAt" : "2025-05-22 06:41:42",
		"updatedAt" : "2025-05-22 06:41:42"
	},
	{
		"id" : "a-b8djm-bR",
		"type" : "blog",
		"title" : "Who Needs to Report Under the Payment Times Reporting Scheme?",
		"slug" : "who-needs-to-report-ptr",
		"content" : "# Who Needs to Report Under the Payment Times Reporting Scheme?\n\n_Published: 18 May 2025 • Author: Monochrome Compliance Team_\n\n## Summary\n\nIf your business operates in Australia and earns over $100 million in annual income, you may be required to report under the Payment Times Reporting Scheme (PTRS). This article explains who is considered a reporting entity and what criteria determine eligibility.\n\n## What Is a Reporting Entity?\n\nA reporting entity under PTRS is broadly defined as:\n\n- An individual business with total annual income over $100 million, or\n- A controlling corporation (parent company) whose combined subsidiaries exceed the $100 million threshold\n\nEligibility is based on the most recent income year prior to the reporting period.\n\n## Thresholds and Triggers\n\n### 1. Income Threshold\n\nBusinesses with over $100 million in total income (not just turnover) are required to report. This includes:\n\n- Australian entities\n- Foreign entities with Australian operations\n- Corporate groups under a controlling corporation\n\n### 2. Corporate Groups\n\nIf your entity is part of a group controlled by a parent entity that exceeds $100 million in consolidated income, the entire group may be captured under the scheme. Only the controlling corporation submits the PTR report for all group members.\n\n### 3. Other Trigger Events\n\nEntities may also become subject to PTR reporting if they acquire another entity or experience substantial structural changes affecting income.\n\n## Examples\n\n- A standalone company with $120M annual income → Must report\n- A holding company with $40M income but subsidiaries that earn $150M → Must report as a controlling corporation\n- A foreign company with a branch operating in Australia earning $110M → Must report\n\n## Legal Disclaimer\n\nThis article provides general information only and is not legal or financial advice. Please consult with the Payment Times Reporting Regulator or a legal advisor to ensure compliance with your organisation's obligations.\n\n## Need Help?\n\n[Get started with Monochrome Compliance](https://monochrome-compliance.com)",
		"description" : "Find out which businesses and corporate structures are required to report under the Australian Payment Times Reporting Scheme.",
		"date" : "2025-05-18 00:00:00",
		"tags" : "PTR,eligibility,reporting obligations,compliance",
		"createdBy" : "import-script",
		"updatedBy" : null,
		"createdAt" : "2025-05-22 06:41:42",
		"updatedAt" : "2025-05-22 06:41:42"
	},
	{
		"id" : "akjeIkQGGt",
		"type" : "faq",
		"title" : "Frequently Asked Questions",
		"slug" : "faq",
		"content" : "\n## Who is required to report under the new PTRS scheme?\n\nOnly entities that meet the new definition of a reporting entity under the Payment Times Reporting Act 2020 are required to report. This includes the highest-level entity in a corporate group that meets consolidated revenue and control criteria.\n\n## What payments need to be included in a report?\n\nEntities must report payments made under trade credit arrangements to Australian small businesses, excluding payments to government or employees, and subject to specific rules around credit cards and ABNs.\n\n## How is the SBI Tool used?\n\nThe SBI Tool must be used after each reporting period to identify small business suppliers based on the calendar year in which the reporting period ended. It is only available via the PTRS Portal.\n\n## What if a report is submitted using the old CSV template?\n\nReports submitted using the CSV template for periods commencing after 1 July 2024 will be rejected. The new scheme requires reports to be submitted through the Portal's webform interface.\n\n## When is a report due?\n\nReports must be submitted within 3 months of the end of the reporting period. Most entities will report biannually based on their financial year.\n\n## What if an entity is acquired or loses control of another entity?\n\nYou must report on payments by all entities you control at the end of the reporting period. If data is not accessible, section 15 of the Rules allows exclusions with disclosures.\n\n## Are credit card payments required to be reported?\n\nYes, if they meet the criteria of a trade credit arrangement, exceed $100 (incl. GST), and are not excluded under a genuinely enforced policy or other exceptions.\n\n## Can more time be requested to submit a report?\n\nYes, via the Portal. Extensions of up to 28 days require a reason, while longer extensions need supporting documentation.\n\n## Do supporting datasets need to be submitted?\n\nNo, but you must retain them for seven years. The TCP and SBTCP datasets are essential for calculating required metrics.\n\n## What support is available if someone gets stuck?\n\nYou're not alone — our platform is designed to guide you through each step with clarity and confidence. Clear instructions, integrated tips, and contextual help are built into the platform, so you can move forward without needing to leave the platform.\n",
		"description" : null,
		"date" : null,
		"tags" : null,
		"createdBy" : "import-script",
		"updatedBy" : null,
		"createdAt" : "2025-05-22 06:41:42",
		"updatedAt" : "2025-05-22 06:41:42"
	},
	{
		"id" : "B2jJS1fhE2",
		"type" : "blog",
		"title" : "How to Submit a PTR Report",
		"slug" : "how-to-submit-ptr-report",
		"content" : "# How to Submit a PTR Report\n\n_Published: 18 May 2025 • Author: Monochrome Compliance Team_\n\n## Summary\n\nSubmitting a Payment Times Reporting (PTR) report is a regulatory requirement for large businesses in Australia. This guide outlines each step of the process — from data preparation and small business identification to CSV formatting and final submission — using Monochrome Compliance to simplify and streamline the workflow.\n\n## Who Needs This?\n\nThis article is designed for individuals responsible for meeting PTR obligations, such as finance leads, governance managers, and compliance teams. If your organisation has over $100 million in annual income or is part of a group that exceeds this threshold, you are legally required to report twice yearly.\n\n## Step-by-Step Submission Guide\n\n### Step 1: Prepare Your Data\n\nStart by gathering supplier invoice and payment data for the current reporting period:\n\n- Supplier ABNs\n- Invoice issue and payment dates\n- Payment amounts\n- Contract payment terms (where available)\n\nEnsure all transactions fall within the correct reporting window: either 1 January–30 June or 1 July–31 December. Data accuracy at this stage is critical.\n\n### Step 2: Identify Small Business Suppliers\n\nExport a list of all supplier ABNs and upload them to the Regulator’s Small Business Identification (SBI) Tool. The tool will return a list of ABNs that are _not_ considered small businesses. This step must be completed for each reporting cycle — you cannot rely on past results.\n\nOnce the SBI Tool output is received, upload it into Monochrome Compliance. The system will automatically flag small business transactions based on the validated ABNs.\n\n### Step 3: Format the PTR Report\n\nImport your cleaned and flagged dataset into Monochrome Compliance. The platform checks for:\n\n- Missing or incorrectly formatted fields\n- Inconsistencies between reported dates and payment terms\n- Small business flag accuracy\n- Payment practices that fall outside acceptable ranges\n\nAny detected issues are flagged for review and correction before the final CSV output is generated.\n\n### Step 4: Lodge the Report\n\nLog in to the Regulator’s PTR Portal and upload the validated CSV file. You will also be prompted to complete a summary declaration and provide additional reporting information.\n\nWe strongly recommend exporting a PDF copy of your submission from the portal or taking a screenshot for internal audit purposes.\n\n## Frequently Asked Questions\n\n**Can I use my own template?**  \nNo — the Regulator mandates a specific CSV format. Monochrome Compliance automatically generates this format for you.\n\n**What if I discover errors after submission?**  \nContact the Regulator as soon as possible. If it’s within the reporting window, you may be allowed to submit a corrected report.\n\n**Do I need to identify small businesses manually?**  \nNo. You must use the SBI Tool and upload the results to your system. Manual classification is not compliant.\n\n## Legal Disclaimer\n\nThis article provides general information only and is not legal or financial advice. Please consult with the Payment Times Reporting Regulator or a legal advisor to ensure compliance with your organisation's obligations.\n\n## Need Help?\n\n[Start your submission with Monochrome Compliance](https://monochrome-compliance.com)",
		"description" : "A step-by-step guide to preparing, validating and lodging your Payment Times Reporting (PTR) submission using Monochrome Compliance.",
		"date" : "2025-05-18 00:00:00",
		"tags" : "PTR,compliance,submission,how-to,reporting",
		"createdBy" : "import-script",
		"updatedBy" : null,
		"createdAt" : "2025-05-22 06:41:42",
		"updatedAt" : "2025-05-22 06:41:42"
	},
	{
		"id" : "c_TlH5lQi9",
		"type" : "faq",
		"title" : "Do supporting datasets need to be submitted?",
		"slug" : "do-supporting-datasets-need-to-be-submitted",
		"content" : "No, but you must retain them for seven years. The TCP and SBTCP datasets are essential for calculating required metrics.",
		"description" : null,
		"date" : null,
		"tags" : null,
		"createdBy" : "import-script",
		"updatedBy" : null,
		"createdAt" : "2025-05-22 06:41:42",
		"updatedAt" : "2025-05-22 06:41:42"
	},
	{
		"id" : "d4WHSiR-YG",
		"type" : "blog",
		"title" : "Avoid These Common PTR Submission Mistakes",
		"slug" : "ptr-submission-mistakes",
		"content" : "# Avoid These Common PTR Submission Mistakes\n\n_Published: 18 May 2025 • Author: Monochrome Compliance Team_\n\n## Summary\n\nPayment Times Reporting (PTR) is more than just a regulatory checkbox — it reflects your organisation’s financial transparency and commitment to fair supplier practices. Unfortunately, many entities fall into avoidable traps during submission. In this guide, we outline the most common mistakes and how to sidestep them using sound governance and practical tools like Monochrome Compliance.\n\n## 1. Incorrect Supplier Classification\n\n**The mistake:** Misidentifying which suppliers qualify as small businesses, either through guesswork or outdated assumptions.\n\n**The fix:** Always validate ABNs using the official Small Business Identification (SBI) Tool provided by the Regulator. Upload your list of ABNs and import the result into Monochrome Compliance to ensure accurate flagging. This step must be completed for each reporting cycle — past results can’t be reused.\n\n## 2. Incomplete or Inconsistent Data\n\n**The mistake:** Submissions that include missing invoice numbers, mismatched payment and issue dates, or incomplete payment terms.\n\n**The fix:** Use a validation tool like Monochrome Compliance to surface issues before submission. Automate data checks and reconcile records with your finance system. Fix inconsistencies early to avoid delays during approval and reporting.\n\n## 3. Outdated CSV Templates\n\n**The mistake:** Using last year’s or last cycle’s CSV export template, which may be missing newly required fields or contain deprecated columns.\n\n**The fix:** Download the latest CSV template directly from the Regulator or export through Monochrome Compliance, which always reflects the most up-to-date format. Validate your data structure before submission.\n\n## 4. Late Submissions\n\n**The mistake:** Leaving data collection and validation too close to the deadline, resulting in rushed reviews or missed due dates.\n\n**The fix:** Work backwards from the deadline. Set internal submission targets at least two weeks prior, with assigned owners and checklists. Use shared calendars or integrated workflow software to monitor task completion.\n\n## 5. No Internal Review Process\n\n**The mistake:** Submitting reports without a second review, increasing the likelihood of human error or oversight.\n\n**The fix:** Establish a two-person signoff process. Use Monochrome Compliance’s PDF export to generate review-ready versions. Store signed copies securely for auditing and assurance purposes.\n\n## Bonus: Not Archiving SBI Tool Results\n\n**The mistake:** Treating the SBI output file as temporary and failing to store it alongside your submission records.\n\n**The fix:** Save both your original ABN input list and the SBI Tool response in a secure, access-controlled location. This serves as audit evidence and ensures continuity across reporting cycles.\n\n## Legal Disclaimer\n\nThis article provides general information only and is not legal or financial advice. Please consult with the Payment Times Reporting Regulator or a legal advisor to ensure compliance with your organisation's obligations.\n\n## Need Help?\n\n[Submit with confidence using Monochrome Compliance](https://monochrome-compliance.com)",
		"description" : "Learn from the most common errors seen in Payment Times Reporting submissions and how to avoid them using good governance and reliable tools.",
		"date" : "2025-05-18 00:00:00",
		"tags" : "PTR,submission errors,compliance,common mistakes",
		"createdBy" : "import-script",
		"updatedBy" : null,
		"createdAt" : "2025-05-22 06:41:42",
		"updatedAt" : "2025-05-22 06:41:42"
	},
	{
		"id" : "HuJVJdLrn_",
		"type" : "faq",
		"title" : "What if a report is submitted using the old CSV template?",
		"slug" : "what-if-a-report-is-submitted-using-the-old-csv-template",
		"content" : "Reports submitted using the CSV template for periods commencing after 1 July 2024 will be rejected. The new scheme requires reports to be submitted through the Portal's webform interface.",
		"description" : null,
		"date" : null,
		"tags" : null,
		"createdBy" : "import-script",
		"updatedBy" : null,
		"createdAt" : "2025-05-22 06:41:42",
		"updatedAt" : "2025-05-22 06:41:42"
	},
	{
		"id" : "IQPIZg4IE8",
		"type" : "faq",
		"title" : "What support is available if someone gets stuck?",
		"slug" : "what-support-is-available-if-someone-gets-stuck",
		"content" : "You're not alone — our platform is designed to guide you through each step with clarity and confidence. Clear instructions, integrated tips, and contextual help are built into the platform, so you can move forward without needing to leave the platform.",
		"description" : null,
		"date" : null,
		"tags" : null,
		"createdBy" : "import-script",
		"updatedBy" : null,
		"createdAt" : "2025-05-22 06:41:42",
		"updatedAt" : "2025-05-22 06:41:42"
	},
	{
		"id" : "kBYJP8c_E9",
		"type" : "faq",
		"title" : "What payments need to be included in a report?",
		"slug" : "what-payments-need-to-be-included-in-a-report",
		"content" : "Entities must report payments made under trade credit arrangements to Australian small businesses, excluding payments to government or employees, and subject to specific rules around credit cards and ABNs.",
		"description" : null,
		"date" : null,
		"tags" : null,
		"createdBy" : "import-script",
		"updatedBy" : null,
		"createdAt" : "2025-05-22 06:41:42",
		"updatedAt" : "2025-05-22 06:41:42"
	},
	{
		"id" : "kmztFKz2pt",
		"type" : "blog",
		"title" : "Your Blog Title Here",
		"slug" : "your-blog-slug",
		"content" : "# Your Blog Title Here\n\n_Published: YYYY-MM-DD • Author: Monochrome Compliance Team_\n\n## Summary\n\nWrite a 2–3 sentence overview explaining what the article covers and why it matters.\n\n## Section Heading 1\n\nIntroduce the topic clearly. Use bullet points if listing actions or tips:\n\n- First tip or consideration\n- Second point\n- Something to avoid\n\n## Section Heading 2\n\nBreak complex topics into smaller chunks. Add clarity with examples, definitions, or context.\n\n## Section Heading 3\n\nFinish with practical guidance, next steps, or how your platform supports the user.\n\n## Need Help?\n\n[Contact us](https://monochrome-compliance.com)\n\n## Legal Disclaimer\n\n_This article provides general information only and is not legal or financial advice. Please consult with the Payment Times Reporting Regulator or a legal advisor to ensure compliance with your organisation's obligations._",
		"description" : "A short summary of the post for previews and SEO.",
		"date" : null,
		"tags" : "",
		"createdBy" : "import-script",
		"updatedBy" : null,
		"createdAt" : "2025-05-22 06:41:42",
		"updatedAt" : "2025-05-22 06:41:42"
	},
	{
		"id" : "nUKQKQAT5y",
		"type" : "blog",
		"title" : "PTR Reporting Deadlines: What You Need to Know",
		"slug" : "ptr-reporting-deadlines",
		"content" : "# PTR Reporting Deadlines: What You Need to Know\n\n<div style=\"font-size: 0.875rem\"><em>Published: 18 May 2025 • Author: Monochrome Compliance Team</em></div>\n\n## Summary\n\nThe Payment Times Reporting Scheme (PTRS) operates on a fixed schedule with clearly defined reporting periods and submission deadlines. Missing a deadline not only attracts regulatory penalties but also signals to the public and your suppliers that compliance is not a priority. This article outlines what you need to know about reporting timeframes and how to stay on track.\n\n## PTR Reporting Periods and Deadlines\n\nEntities captured under the PTRS must submit a report **twice per year**, in line with the following periods:\n\n- **First half-year reporting period:**  \n  **1 January – 30 June**  \n  **Submission due by: 30 September**\n\n- **Second half-year reporting period:**  \n  **1 July – 31 December**  \n  **Submission due by: 31 March**\n\nThere are no extensions available unless formally requested and approved under exceptional circumstances. Late reports are flagged on the Regulator’s public register and may result in financial penalties.\n\n## Why Deadlines Matter\n\nReporting deadlines are enforced under Australian legislation. Timeliness is an indicator of governance maturity and supplier fairness. Repeated late submissions can erode trust, damage your reputation, and impact your eligibility for government contracts.\n\nYour submission will be visible on the public register, including whether it was submitted on time or late — making this a public-facing compliance obligation.\n\n## Internal Planning Checklist\n\nTo stay ahead of PTR deadlines, consider embedding the following practices into your internal reporting calendar:\n\n- **Start early:** Begin preparing data and reviewing supplier lists 6–8 weeks before the due date\n- **Nominate a lead:** Assign a dedicated owner for PTR reporting, usually within Finance or Governance\n- **Set internal checkpoints:** Schedule key milestones for SBI Tool checks, data validation, and internal review\n- **Conduct a dry run:** Generate a draft report and review it with relevant stakeholders before finalisation\n- **Use shared calendars:** Set recurring internal reminders well ahead of the official submission dates\n\n## Risks of Missing the Deadline\n\nIf your organisation fails to meet its PTR obligation on time:\n\n- Your entity will be listed as non-compliant on the PTR public register\n- Financial penalties may apply\n- You may be subject to increased scrutiny from procurement bodies and regulators\n- Future reporting may be monitored more closely\n\n## Monochrome Compliance Helps You Stay Ahead\n\nThe Monochrome Compliance platform provides:\n\n- Built-in reminders aligned to PTR deadlines\n- Status tracking for data readiness and SBI tool results\n- Export-ready CSV templates in the current format\n- Submission-ready validation to ensure accuracy before upload\n\nOur tools reduce the stress of compliance reporting and help your team deliver on time, every time.\n\n## Legal Disclaimer\n\nThis article provides general information only and is not legal or financial advice. Please consult with the Payment Times Reporting Regulator or a legal advisor to ensure compliance with your organisation's obligations.\n\n## Need Help?\n\n[Never miss another PTR deadline](https://monochrome-compliance.com)",
		"description" : "Understand the key reporting periods and submission dates for the Payment Times Reporting Scheme so your business never misses a deadline.",
		"date" : "2025-05-18 00:00:00",
		"tags" : "PTR,deadlines,reporting calendar,compliance",
		"createdBy" : "import-script",
		"updatedBy" : null,
		"createdAt" : "2025-05-22 06:41:42",
		"updatedAt" : "2025-05-22 06:41:42"
	},
	{
		"id" : "OvkWWSP2Pj",
		"type" : "faq",
		"title" : "How is the SBI Tool used?",
		"slug" : "how-is-the-sbi-tool-used",
		"content" : "The SBI Tool must be used after each reporting period to identify small business suppliers based on the calendar year in which the reporting period ended. It is only available via the PTRS Portal.",
		"description" : null,
		"date" : null,
		"tags" : null,
		"createdBy" : "import-script",
		"updatedBy" : null,
		"createdAt" : "2025-05-22 06:41:42",
		"updatedAt" : "2025-05-22 06:41:42"
	},
	{
		"id" : "pxwDvWE5HQ",
		"type" : "faq",
		"title" : "What if an entity is acquired or loses control of another entity?",
		"slug" : "what-if-an-entity-is-acquired-or-loses-control-of-another-entity",
		"content" : "You must report on payments by all entities you control at the end of the reporting period. If data is not accessible, section 15 of the Rules allows exclusions with disclosures.",
		"description" : null,
		"date" : null,
		"tags" : null,
		"createdBy" : "import-script",
		"updatedBy" : null,
		"createdAt" : "2025-05-22 06:41:42",
		"updatedAt" : "2025-05-22 06:41:42"
	},
	{
		"id" : "RshYePcQY8",
		"type" : "blog",
		"title" : "How to Use the SBI Tool to Flag Small Business Payments",
		"slug" : "using-sbi-tool-for-ptr",
		"content" : "# How to Use the SBI Tool to Flag Small Business Payments\n\n_Published: 18 May 2025 • Author: Monochrome Compliance Team_\n\n## Summary\n\nCorrectly identifying small business suppliers is a key part of Payment Times Reporting (PTR). The Regulator provides a purpose-built Small Business Identification (SBI) Tool to ensure consistent and accurate classification of suppliers based on ABNs. This guide walks through how the tool works, why it's mandatory, and how Monochrome Compliance integrates it into your workflow.\n\n## What Is the SBI Tool?\n\nThe SBI Tool is an online utility provided by the Payment Times Reporting Regulator. It allows entities to submit a list of supplier ABNs and returns a validated output that distinguishes which suppliers are _not_ classified as small businesses.\n\nUnder PTR legislation, this tool is the only approved method for making small business determinations. You cannot rely on internal knowledge, size estimates, or assumptions — doing so risks submitting a non-compliant report.\n\n## Why Is This Important?\n\nPTR obligations require entities to report how quickly they pay small businesses. If your submission fails to accurately flag these suppliers, you could understate or misrepresent your payment practices. This affects compliance outcomes and may damage your standing with regulators and the public.\n\nUsing the SBI Tool ensures:\n\n- Consistency across reporting entities\n- Confidence that your flagged data meets legal standards\n- Traceable, auditable compliance history\n\n## Step-by-Step Process\n\n### 1. Prepare Your Supplier ABN List\n\nExport a complete list of ABNs from your accounts payable records for the current reporting period. This list should:\n\n- Be limited to suppliers who were paid during the period\n- Exclude non-ABN payees (such as individuals or foreign entities without ABNs)\n- Remove duplicates and validate ABN formatting (11 digits, no spaces)\n\n### 2. Use the Regulator’s SBI Tool\n\n- Access the tool via the PTR Regulator’s website\n- Upload your CSV or paste in the ABNs according to the tool’s guidance\n- Submit the request and wait for the response file\n\nThe output will contain only the ABNs that are _not_ small businesses. All others should be considered small businesses for reporting purposes.\n\n### 3. Upload Results into Monochrome Compliance\n\nWith Monochrome Compliance, you can directly import the SBI Tool output. The platform will automatically match each ABN to your payment records and apply the appropriate small business flag.\n\nThis process eliminates manual matching and reduces the chance of error — giving you a clean, compliant PTR file.\n\n## Additional Tips\n\n- Run the SBI check as late as practical in the reporting cycle to ensure accuracy (e.g. ABNs may change status).\n- Always double-check that your ABN data hasn’t been modified or truncated in Excel or other editors.\n- Archive both your submitted ABN list and the SBI Tool output for auditing purposes.\n\n## Legal Disclaimer\n\nThis article provides general information only and is not legal or financial advice. Please consult with the Payment Times Reporting Regulator or a legal advisor to ensure compliance with your organisation's obligations.\n\n## Need Help?\n\n[Get help flagging small business payments](https://monochrome-compliance.com)",
		"description" : "Learn how to identify which suppliers are small businesses using the Payment Times Reporting Regulator’s Small Business Identification (SBI) Tool.",
		"date" : "2025-05-18 00:00:00",
		"tags" : "PTR,SBI Tool,small business,supplier flagging",
		"createdBy" : "import-script",
		"updatedBy" : null,
		"createdAt" : "2025-05-22 06:41:42",
		"updatedAt" : "2025-05-22 06:41:42"
	},
	{
		"id" : "saIbUcnkmT",
		"type" : "faq",
		"title" : "Who is required to report under the new PTRS scheme?",
		"slug" : "who-is-required-to-report-under-the-new-ptrs-scheme",
		"content" : "Only entities that meet the new definition of a reporting entity under the Payment Times Reporting Act 2020 are required to report. This includes the highest-level entity in a corporate group that meets consolidated revenue and control criteria.",
		"description" : null,
		"date" : null,
		"tags" : null,
		"createdBy" : "import-script",
		"updatedBy" : null,
		"createdAt" : "2025-05-22 06:41:42",
		"updatedAt" : "2025-05-22 06:41:42"
	},
	{
		"id" : "usq0zZ3c3L",
		"type" : "faq",
		"title" : "When is a report due?",
		"slug" : "when-is-a-report-due",
		"content" : "Reports must be submitted within 3 months of the end of the reporting period. Most entities will report biannually based on their financial year.",
		"description" : null,
		"date" : null,
		"tags" : null,
		"createdBy" : "import-script",
		"updatedBy" : null,
		"createdAt" : "2025-05-22 06:41:42",
		"updatedAt" : "2025-05-22 06:41:42"
	},
	{
		"id" : "x73mRqJkgR",
		"type" : "blog",
		"title" : "How to Improve Data Quality Before Submitting Your PTR Report",
		"slug" : "improve-data-quality",
		"content" : "When it comes to Payment Times Reporting, clean data is everything.\n\nBefore you upload your CSV file or generate your final report, take a few minutes to check for common issues that can cause delays — or worse, non-compliance.\n\n## 1. Confirm Required Fields Are Present\n\nMake sure your data includes:\n\n- ABNs for both payer and payee\n- Invoice date and payment date\n- Payment amount\n- Contract or PO reference (if applicable)\n\nDon’t leave mandatory fields blank — the validator will flag them immediately.\n\n## 2. Watch for Typos and Formatting Errors\n\n- Use consistent date formats (e.g. YYYY-MM-DD)\n- Round payment values to whole dollars if needed\n- Avoid invisible characters or extra whitespace\n\nA simple find-and-replace or export to plain CSV can help clear these up.\n\n## 3. Use Our Template\n\nThe best way to avoid errors? Use the [CSV template](/resources) we’ve provided. It includes the right column headers, in the right order — and some bonus tips in the comments too.\n\n## 4. Preview Your Report Before Submitting\n\nOur platform offers a live preview of your summary stats, validation errors, and flagged records. Use it. Fix it. Then finalise.\n\n---\n\nBetter data means faster reporting, fewer headaches, and a better impression with the regulator.\n\nStill have questions? [Check the FAQ](/faq) or [contact us](/contact).",
		"description" : "Bad data can derail your submission. Here’s how to clean, validate, and catch issues before they become a problem.",
		"date" : "2025-05-19 00:00:00",
		"tags" : "",
		"createdBy" : "import-script",
		"updatedBy" : null,
		"createdAt" : "2025-05-22 06:41:42",
		"updatedAt" : "2025-05-22 06:41:42"
	},
	{
		"id" : "Ykx79HTmB_",
		"type" : "blog",
		"title" : "What’s Changed in PTR Legislation in 2025?",
		"slug" : "ptr-legislation-2025",
		"content" : "# What’s Changed in PTR Legislation in 2025?\n\n_Published: 18 May 2025 • Author: Monochrome Compliance Team_\n\n## Summary\n\nThe Payment Times Reporting Scheme (PTRS) underwent several important updates in 2025. These legislative refinements aim to increase clarity, strengthen compliance, and ensure that large businesses meet their obligations to pay small suppliers on time. This article outlines the key changes and what they mean for your reporting processes.\n\n## Why the Changes Were Introduced\n\nThe PTR Regulator identified gaps in reporting consistency, classification accuracy, and enforcement strength during the first few years of the scheme’s operation. The 2025 amendments were introduced to ensure better alignment between legislative intent and practical implementation — and to improve supplier outcomes.\n\n## Key Legislative Changes\n\n### 1. Updated Definition of Small Business\n\nThe definition of a “small business” has been aligned with the Australian Bureau of Statistics (ABS) classification standards. This change standardises who qualifies for protection under the scheme.\n\n> You must continue to use the Regulator’s official SBI Tool to verify small business status. Internal estimates or subjective classifications are not compliant.\n\n### 2. Reporting Thresholds Clarified\n\nLegislation now confirms that entities earning **exactly** $100 million in annual income are subject to PTR obligations. Previously, there was ambiguity about whether the threshold was exclusive or inclusive.\n\nThis change eliminates uncertainty and ensures consistent treatment of borderline cases.\n\n### 3. Increased Penalties for Non-Compliance\n\nPenalties for both late and inaccurate reporting have been significantly increased. These now include:\n\n- Higher monetary fines\n- Public visibility of infractions on the PTR register\n- Potential exclusion from government procurement opportunities\n\n> If your entity relies on government contracts, this change makes timely and accurate reporting even more critical.\n\n### 4. Tighter Criteria for Reporting Extensions\n\nWhile the biannual submission schedule remains unchanged, criteria for obtaining deadline extensions have been narrowed. Entities must now demonstrate exceptional circumstances and provide supporting documentation.\n\nLate submissions without approval are likely to result in public censure and financial penalties.\n\n## What This Means for Your Organisation\n\nTo meet the new expectations, reporting entities should:\n\n- Begin data gathering and SBI validation earlier in the cycle\n- Review ABN accuracy more frequently\n- Assign clear internal responsibility for PTR submissions\n- Use purpose-built tools like Monochrome Compliance to ensure alignment with the latest formats and rules\n\n## Moving Forward\n\nThese changes reflect the Regulator’s intention to increase transparency and strengthen accountability. By proactively updating your processes now, you’ll avoid compliance issues later — and demonstrate your organisation’s commitment to ethical supplier practices.\n\n## Legal Disclaimer\n\nThis article provides general information only and is not legal or financial advice. Please consult with the Payment Times Reporting Regulator or a legal advisor to ensure compliance with your organisation's obligations.\n\n## Need Help?\n\n[Stay up to date with Monochrome Compliance](https://monochrome-compliance.com)",
		"description" : "A summary of key legislative changes to the Payment Times Reporting Scheme in 2025, including updated definitions, obligations and deadlines.",
		"date" : "2025-05-18 00:00:00",
		"tags" : "PTR,legislation,2025 changes,compliance updates",
		"createdBy" : "import-script",
		"updatedBy" : null,
		"createdAt" : "2025-05-22 06:41:42",
		"updatedAt" : "2025-05-22 06:41:42"
	}
]
